Public Attributes | List of all members
API_WindowQuantity Struct Reference
Element Manager API
Describes the different calculated values for windows. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | width1
Window/door opening width on the reveal side.
double  | width2
Window/door opening width on the side opposite to the reveal side.
double  | height1
Window/door opening height on the reveal side.
double  | height2
Window/door opening height on the side opposite to the reveal side.
double  | surface1
Window/door opening surface on the reveal side.
double  | surface2
Window/door opening surface on the side opposite to the reveal side.
double  | nWidth1
Nominal window/door opening width on the reveal side.
double  | nWidth2
Nominal window/door opening width on the side opposite to the reveal side.
double  | nHeight1
Nominal window/door opening height on the reveal side.
double  | nHeight2
Nominal window/door opening height on the side opposite to the reveal side.
double  | nSurface1
Nominal window/door opening surface on the side opposite to the reveal side.
double  | nSurface2
Nominal window/door opening surface on the side opposite to the reveal side.
double  | volume
Window/door opening volume.
double  | grossSurf
Window/door opening nominal surface.
double  | grossVolume
Window/door opening nominal volume.
double  | surface
surface of the window/door
double  | sillHeight
Window/door nominal sill height.
double  | sillHeight1
Window/door sill height on the reveal side.
double  | sillHeight2
Window/door sill height on the side opposite to the reveal side.
double  | headHeight
Window/door nominal head height.
double  | headHeight1
Window/door head height on the reveal side.
double  | headHeight2
Window/door head height on the side opposite to the reveal side.
double  | sillHeight3
Window/door sill height according to the vertical anchor.
double  | headHeight3
Window/door head height according to the vertical anchor.
Detailed Description
Describes the different calculated values for windows.
Remarks
See also the window parameters in Appendix A of the GDL Reference manual. See also API_DoorQuantity.
Member Data Documentation
◆ grossSurf
 API_WindowQuantity::grossSurf
Window/door opening nominal surface.
◆ grossVolume
 API_WindowQuantity::grossVolume
Window/door opening nominal volume.
◆ headHeight
 API_WindowQuantity::headHeight
Window/door nominal head height.
◆ headHeight1
 API_WindowQuantity::headHeight1
Window/door head height on the reveal side.
◆ headHeight2
 API_WindowQuantity::headHeight2
Window/door head height on the side opposite to the reveal side.
◆ headHeight3
 API_WindowQuantity::headHeight3
Window/door head height according to the vertical anchor.
◆ height1
 API_WindowQuantity::height1
Window/door opening height on the reveal side.
◆ height2
 API_WindowQuantity::height2
Window/door opening height on the side opposite to the reveal side.
◆ nHeight1
 API_WindowQuantity::nHeight1
Nominal window/door opening height on the reveal side.
◆ nHeight2
 API_WindowQuantity::nHeight2
Nominal window/door opening height on the side opposite to the reveal side.
◆ nSurface1
 API_WindowQuantity::nSurface1
Nominal window/door opening surface on the side opposite to the reveal side.
◆ nSurface2
 API_WindowQuantity::nSurface2
Nominal window/door opening surface on the side opposite to the reveal side.
◆ nWidth1
 API_WindowQuantity::nWidth1
Nominal window/door opening width on the reveal side.
◆ nWidth2
 API_WindowQuantity::nWidth2
Nominal window/door opening width on the side opposite to the reveal side.
◆ sillHeight
 API_WindowQuantity::sillHeight
Window/door nominal sill height.
◆ sillHeight1
 API_WindowQuantity::sillHeight1
Window/door sill height on the reveal side.
◆ sillHeight2
 API_WindowQuantity::sillHeight2
Window/door sill height on the side opposite to the reveal side.
◆ sillHeight3
 API_WindowQuantity::sillHeight3
Window/door sill height according to the vertical anchor.
◆ surface
 API_WindowQuantity::surface
surface of the window/door
◆ surface1
 API_WindowQuantity::surface1
Window/door opening surface on the reveal side.
◆ surface2
 API_WindowQuantity::surface2
Window/door opening surface on the side opposite to the reveal side.
◆ volume
 API_WindowQuantity::volume
Window/door opening volume.
◆ width1
 API_WindowQuantity::width1
Window/door opening width on the reveal side.
◆ width2
 API_WindowQuantity::width2
Window/door opening width on the side opposite to the reveal side.